# author: Xiname
# -*- coding: utf-8 -*-
# @Time : 2023/12/24 11:05
# @File ：16threeSumClosest.py
# @IDE ：PyCharm
# 给你一个长度为 n 的整数数组 nums 和 一个目标值 target。请你从 nums 中选出三个整数，使它们的和与 target 最接近。
#
# 返回这三个数的和。
#
# 假定每组输入只存在恰好一个解。
from math import inf
from typing import List


class Solution:
    def threeSumClosest(self, nums: List[int], target: int) -> int:
        nums.sort()
        temp = inf
        for k in range(len(nums)):
            i, j = k + 1, len(nums) - 1
            while i < j:
                s = nums[k] + nums[i] + nums[j]
                if s == target:
                    return s
                # 更新值
                if abs(s - target) <= abs(temp - target):
                    # print('s,k,i,j', s, nums[k], nums[i], nums[j])
                    temp = s
                # 移动指针
                if s <= target:
                    i += 1
                elif s > target:
                    j -= 1

        return temp


s = Solution()
print(s.threeSumClosest([-13, 592, -501, 770, -952,
                         -675, 322, -829, -246, 657, 608, 485
                            , -112, 967, -30, 182, -969, 559,
                         -286, -64, 24, 365, -158, 701, 535, -429,
                         -217, 28, 948, -114, -536, -711, 693, 23,
                         -958, -283, -700, -672, 311, 314, -712,
                         -594, -351, 658, 747, 949, 70, 888, 166,
                         495, 244, -380, -654, 454, -281, -811,
                         -168, -839, -106, 877, -216, 523, -234,
                         -8, 289, -175, 920, -237, -791, -976,
                         -509, -4, -3, 298, -190, 194, -328, 265, 150, 210, 285,
                         -176, -646, -465, -97, -107, 668, 892, 612, -54, -272,
                         -910, 557, -212, -930, -198, 38, -365, -729, -410, 932, 4,
                         -565, -329, -456, 224, 443, -529, -428, -294, 191, 229, 112,
                         -867, -163, -979, 236, -227, -388, -209, 984, 188, -549, 970,
                         951, -119, -146, 801, -554, 564, -769, 334, -819, -356, -724,
                         -219, 527, -405, -27, -759, 722, -774, 758, 394, 146, 517, 870,
                         -208, 742, -782, 336, -364, -558, -417, 663, -914, 536, 293,
                         -818, 847, -322, 408, 876, -823, 827, 167], 7175))
